import React from 'react';

const users = [
    'Андрей Пивоваров',
    'Максим Галактионов',
    'Алла Лин',
    'Константин Константинопольский Константинович',
    'Игорь Иванченко',
    'Юлия Эйчаровна',
    'Артём Подпрыгайко-Саппортов',
    'Илья Вазнец',
    'Михаил Вортенов',
    'Наталья Нашевна',
    'Евгения Итамовна',
    'Алиса Киральчук',
];

export const MultiSelect: React.FC = () => {
    return (
        <div className='selected-input'>
            <label>Согласующие</label>
            <div className='selected-input-content'>
                <div className='multi-select input-container'>
                    <div className='input-multiselect-container'>
                        {users.map((user) => (
                            <div className='tag input-multiselect-tag'>
                                <span className='tag-text'>{user}</span>
                                <button className='tag-remove-btn'>
                                    <svg
                                        aria-hidden='true'
                                        aria-label='Удалить'
                                        width='10'
                                        height='10'
                                        viewBox='0 0 10 10'
                                        fill='none'
                                        xmlns='http://www.w3.org/2000/svg'
                                    >
                                        <path
                                            d='M9.47141 1.4714C9.73176 1.21105 9.73176 0.788945 9.47141 0.528596C9.21106 0.268246 8.78894 0.268246 8.52859 0.528596L5 4.05719L1.4714 0.528596C1.21105 0.268246 0.788945 0.268246 0.528596 0.528596C0.268246 0.788945 0.268246 1.21105 0.528596 1.4714L4.05719 5L0.528596 8.52859C0.268246 8.78894 0.268246 9.21106 0.528596 9.47141C0.788945 9.73176 1.21105 9.73176 1.4714 9.47141L5 5.94281L8.52859 9.47141C8.78894 9.73176 9.21106 9.73176 9.47141 9.47141C9.73176 9.21106 9.73176 8.78894 9.47141 8.52859L5.94281 5L9.47141 1.4714Z'
                                            fill='#2E3238'
                                        />
                                    </svg>
                                </button>
                            </div>
                        ))}
                    </div>

                    <button className='tag-remove'>
                        <svg
                            aria-hidden='true'
                            aria-label='Удалить'
                            width='16'
                            height='16'
                            viewBox='0 0 16 16'
                            fill='none'
                            xmlns='http://www.w3.org/2000/svg'
                        >
                            <path
                                d='M6.47336 10.4749C6.21336 10.7349 5.78671 10.7349 5.52671 10.4749C5.26671 10.2149 5.26671 9.78833 5.52671 9.52833L7.05336 8.00164L5.52671 6.47495C5.26671 6.21495 5.26671 5.78833 5.52671 5.52833C5.78671 5.26833 6.21336 5.26833 6.47336 5.52833L8.00003 7.05503L9.52671 5.52833C9.78671 5.26833 10.2134 5.26833 10.4734 5.52833C10.7334 5.78833 10.7334 6.21495 10.4734 6.47495L8.94671 8.00164L10.4734 9.52833C10.7334 9.78833 10.7334 10.2149 10.4734 10.4749C10.2134 10.7349 9.78671 10.7349 9.52671 10.4749L8.00003 8.94826L6.47336 10.4749Z'
                                fill='#ABB1BA'
                            />
                            <path
                                fill-rule='evenodd'
                                clip-rule='evenodd'
                                d='M15.3333 8.00163C15.3333 12.055 12.0533 15.335 8 15.335C3.94667 15.335 0.666667 12.055 0.666667 8.00163C0.666667 3.94829 3.94667 0.668294 8 0.668294C12.0533 0.668294 15.3333 3.94829 15.3333 8.00163ZM14 8.00163C14 4.68829 11.3133 2.00163 8 2.00163C4.68667 2.00163 2 4.68829 2 8.00163C2 11.315 4.68667 14.0016 8 14.0016C11.3133 14.0016 14 11.315 14 8.00163Z'
                                fill='#ABB1BA'
                            />
                        </svg>
                    </button>
                </div>
                <button className='add-btn'>
                    <svg
                        aria-hidden='true'
                        aria-label='Добавить'
                        width='20'
                        height='20'
                        viewBox='0 0 20 20'
                        fill='none'
                        xmlns='http://www.w3.org/2000/svg'
                    >
                        <path
                            d='M10.8333 4.16667C10.8333 3.70643 10.4602 3.33333 10 3.33333C9.53976 3.33333 9.16667 3.70643 9.16667 4.16667V9.16667H4.16667C3.70643 9.16667 3.33333 9.53976 3.33333 10C3.33333 10.4602 3.70643 10.8333 4.16667 10.8333H9.16667V15.8333C9.16667 16.2936 9.53976 16.6667 10 16.6667C10.4602 16.6667 10.8333 16.2936 10.8333 15.8333V10.8333H15.8333C16.2936 10.8333 16.6667 10.4602 16.6667 10C16.6667 9.53976 16.2936 9.16667 15.8333 9.16667H10.8333V4.16667Z'
                            fill='#2E3238'
                        />
                    </svg>
                </button>
                <button className='search-btn'>
                    <svg
                        aria-hidden='true'
                        aria-label='Поиск'
                        width='20'
                        height='20'
                        viewBox='0 0 20 20'
                        fill='none'
                        xmlns='http://www.w3.org/2000/svg'
                    >
                        <path
                            fill-rule='evenodd'
                            clip-rule='evenodd'
                            d='M13.8481 15.0265C12.565 16.0529 10.9375 16.6667 9.16667 16.6667C5.02453 16.6667 1.66667 13.3088 1.66667 9.16667C1.66667 5.02453 5.02453 1.66667 9.16667 1.66667C13.3088 1.66667 16.6667 5.02453 16.6667 9.16667C16.6667 10.9375 16.053 12.565 15.0266 13.848L18.0892 16.9107C18.4147 17.2361 18.4147 17.7637 18.0892 18.0892C17.7638 18.4146 17.2362 18.4146 16.9107 18.0892L13.8481 15.0265ZM3.33333 9.16667C3.33333 5.94501 5.94501 3.33333 9.16667 3.33333C12.3883 3.33333 15 5.94501 15 9.16667C15 10.7381 14.3786 12.1644 13.3681 13.2133C13.3395 13.2353 13.312 13.2594 13.2857 13.2857C13.2595 13.3119 13.2354 13.3394 13.2134 13.3681C12.1645 14.3786 10.7382 15 9.16667 15C5.94501 15 3.33333 12.3883 3.33333 9.16667Z'
                            fill='#2E3238'
                        />
                    </svg>
                </button>
            </div>
        </div>
    );
};
